# Написать скрипт в любой парадигме, который выводит на экран таблицу умножения всех чисел от 1 до n.
n = int (input('Введите n: '))
while n<2 or n>100:
   print ('Число должно быть от 2 до 10')
for x in range (2, 12):
   print (n, '*', x, '=', n*x)

#В данном решении выбрана структурная парадигма,так как нет смысла использовать процедуры в такой простой задаче
# + используется for ,а не goto и задача исполняется сверху вниз.